items = [
    dict(
        roll=1,
        value="Доспех Шустрый-Шаг",
        description="Полный темно-коричневый кожаный доспех с красной подкладкой. Дает носящему преимущество при"
                    " проверке ловкости",
    ),
    dict(
        roll=2,
        value="Видящий Метки",
        description="Клепанный кожаный доспех с металлическими заклепками, которые переходят от золотых к черным. Раз в"
                    " день позволяет носящему наложить заклинание Зеркального Отражения на себя, заставляя заклепки"
                    " танцевать и вертеться.",
    ),
    dict(
        roll=3,
        value="Шкура Лютоволка",
        description="Шкура с капюшоном из головы волка. Она зачарована чтобы получить скорость зверя. Раз в день на 1"
                    " час носящий может увеличить скорость на 20 фт.",
    ),
    dict(
        roll=4,
        value="Кольчужная Рубашка Морозной Ковки",
        description="Сделана из ледяной стали и холодная на ощупь. За каждые 15 очков урона холодом, полученные носящим"
                    " увеличивает свой КД на 1.",
    ),
    dict(
        roll=5,
        value="Полудоспех Мести",
        description="Полудоспех из темной бронзы с вплавленными черепами. Когда кто-нибудь выбрасывает чистую 20 на"
                    " атаку против носящего, атакующий тут же получает 2d6 урона некротикой.",
    ),
    dict(
        roll=6,
        value="Чешуйчатый Доспех Убийцы Магов",
        description="Черный доспех, собранный из блестящих чешуй. Добавляет +4 ко всем спасброскам сопротивления или"
                    " уклонения от магии",
    ),
    dict(
        roll=7,
        value="Атрибут Праведности",
        description="Серебряная кольчуга настолько яркая, что практически светится. Исчадья, Нежить и Абберации"
                    " получают помеху при атаке носящего.",
    ),
    dict(
        roll=8,
        value="Панцирь Лавовой Ковки",
        description="Черный панцирь с красными и оранжевыми разводами по нему. Дает носящему сопротивление к урону"
                    " огнем.",
    ),
]
