[
  {
    "name": "Аморфная форма",
    "description": "Аморфная форма, или туманность, в описании любого космического объекта обозначает только то, что никакой постоянной формы этот объект не имеет. Облако и облако, только космическое! Встречаются аморфные тела, меняющие свою конфигурацию очень медленно, а бывают и те, что постоянно находятся в движении, а иногда попадаются и такие, что способны измениться в один миг!"
  },
  {
    "name": "Пояс",
    "description": "Эта форма у всех на слуху, про «пояс астероидов» вы наверняка слышали и без меня, верно? Обычно в состав такого пояса входят небесные тела, состоящие, главным образом, из скальной породы, хотя не редко можно встретить здесь и обширные водные пространства — как жидкие, так и замерзшие в незапамятные времена.\nПояс обычно «опоясывает» первичное тело какой-либо Хрустальной Сферы и представляет собой скопище небольших по размеру объектов, которые называют еще планетоидами, т.е. маленькими планетами.\nЕсли поясом «опоясано» не первичное тело Сферы, а планета, пояс принято называть «кольцом». Если пояс астероидов полностью окружает первичное тело, его называют «раковиной»."
  },
  {
    "name": "Кластер",
    "description": "Кластер — группа небольших небесных тел примерно одного размера, держащихся вместе. Хотя многие кластеры образовались естественным путем, встречаются и те, что появились вследствие раскола планеты, вызванного ужасным катаклизмом или не менее ужасным оружием."
  },
  {
    "name": "Плоские миры",
    "description": "Да, плоскость она плоскость и есть — здоровенный блин, опоясанный по краю кольцом неприступных гор, непреодолимым океаном или накрытый стеклянным колпаком :). Как правило, в таких мирах вся жизнь сосредоточена только на одной стороне «блина», хотя встречаются и «двухсторонние» плоские миры, которые принято называть «Дисковыми»."
  },
  {
    "name": "Эллипс",
    "description": "Эллиптические тела имеют форму вытянутой или приплюснутой сферы."
  },
  {
    "name": "Правильной формы",
    "description": "Такие небесные тела имеют строго определенную форму, не похожую ни на одну из описных выше. Многообразие подобных тел очень широко, это может быть и планета простой, кубической формы, и поражающий воображение гигантский комплекс плоскостей и вершин, напоминающий гигантскую снежинку."
  },
  {
    "name": "Неправильной формы",
    "description": "Подобные небесные тела не опишешь ни в одной классификации — что ни экземпляр, то образец с ярко выраженной уникальностью. Любой маленький астероид, напоминающий с виду картофелину и встречающийся в любом астероидном поясе, может послужить примером … небесного тела."
  }
]
