[
  {
    "world_type": "Воздушный Мир",
    "description": "Воздушные миры характеризуются своими почти безграничными небесами, мощными штормами, и множеством облаков. Большая часть таких миров будет иметь плывущие на разных высотах, по круговым орбитам, острова, или даже целые континенты, удерживаемые притяжением, магией или просто неизвестными силами природы. В тех местах, где напрочь отсутствуют плавучие острова, можно запросто столкнуться с облаками, настолько плотными, что по ним можно ходить, почти не проваливаясь.\nОбычно Воздушные миры отличаются Гигантским или Большим размером, а Мелкие, среди них почти не встречаются. Газовые гиганты и туманности — примеры воздушных миров.",
    "encounters": "Жители Элементального Плана Воздуха встречаются здесь наиболее часто, впрочем, как и многие другие существа, способные к полету. На плавающих (вернее летающих) островах можно встретить логово практически любого существа.",
    "sizes": ["D", "E", "F", "G", "H", "I", "J"]
  },
  {
    "world_type": "Земляной Мир",
    "description": "Земляные миры хорошо знакомы искателям приключений. Они бывают очень разными — от крошечных астероидов, до огромных каменистых планет. Земляные миры часто бывают обитаемы, так как комбинация твердой почвы под ногами, воздуха, воды и огня в достаточных количествах, здесь наиболее приемлема для жизни растений, животных и гуманоидов.",
    "encounters": "На земляном мире можно столкнуться с любым существом. Стандартные игровые расы чаще всего обитают именно на мирах такого типа.",
    "sizes": ["A", "B", "C","D", "E", "F"]
  },
  {
    "world_type": "Огненный Мир",
    "description": "Огненные миры известны своим невыносимым жаром, по сравнению с которым освежающим бризом кажется даже дыхание красного дракона. Обычно поверхность огненных миров представляет собой сплошное поле кипящей лавы, и больше всего напоминает Элементальный План Огня. Очень редко на их поверхности можно встретить островки твердых скал, ведь чудовищного жара источаемого недрами, не выдержит ни одна порода.",
    "encounters": "В огненном мире можно столкнуться только с существами совершенно не восприимчивыми к огню, например, с обитателями Элементального Плана Огня.",
    "sizes": ["D", "E", "F", "G", "H", "I", "J"]
  },
  {
    "world_type": "Водный Мир",
    "description": "Водный мир — один гигантский океан, без конца и края, на поверхности которого нет ни одного континента. Некоторые миры такого типа имеют воздушную атмосферу, хотя другие прекрасно обходятся и без нее. Торчащие из воды обломки скал и поля водорослей — вот единственные более-менее твердые участки водных миров.",
    "encounters": "Здесь можно нарваться разве что на существ, способных дышать под водой. Столкновения с другими существами ограничены плавающими островами.",
    "sizes": ["A", "B", "C","D", "E", "F"]
  },
  {
    "world_type": "Живой Мир",
    "description": "Живой мир не просто наполнен жизнью. Живой мир и есть реальное живое существо — гигантское растение или колония таких растений, а может и животное просто невообразимых размеров! Мир-растение на поверхности мало чем отличается от обычных дождевых лесов или джунглей.\nМир-животное (если можно так сказать) может нести на разных участках своего тела вполне привычные для любого искателя приключений ландшафты, как, например, гигантская черепаха, на панцире которой уютно разместился целый мир.",
    "encounters": "Подобно земляным мирам, на живом мире можно столкнуться с любым другим существом.",
    "sizes": ["A", "B", "C","D", "E", "F"]
  }
]