"""
Самое время для случайного столкновения

Когда и как часто нужно вставлять в свои игры энкаунтеры-случайные столкновения
с врагами и мирными встречными персонажами?

Самое время для случайного столкновения в настольной ролевой игре

Сегодня у меня для вас небольшая кучка прикладных правил, под образным
названием «как добавить порядка в случайные столкновения». Касается она той
части путешествий, которую обычно игроки и ведущие склонны пропускать в плане
отыгрыша – собственно перемещения из точки А к точке Б. Ну вы знаете эту тему:

«Вы в пути 6 часов, так, что тут у нас… ага! Банда орков! Так, разобрались,
двигаем дальше – впереди ещё полдня дороги».

В принципе, это работает и всех устраивает. Лишь одна деталь всегда вызывала у
меня легкое желание как-то урегулировать процесс: насколько часто должны
встречаться в пути пресловутые «банды орков» и вообще, насколько частыми будут
подобные случайные встречи (энкаунтеры)?

В итоге, получилось то что вы видите перед собой, и сейчас я расскажу как это
работает.

Виды событий
Столкновение
Путевая встреча/Возможное столкновение
Привал/Возможное столкновение
Подсказка
Трата ресурсов
Задержка в пути
Столкновение – хо-хо, а вот и орки. В смысле, сейчас будет драка.

Путевая встреча – не связанное с «военными действиями» событие, характерное для этой местности. Встреча с купеческими
караванами на дороге или с дровосеком в лесу – вот и все примеры.

Привал – если вы сейчас же не сделаете привал (короткий, на 1 час), то или лошадь захромает, или уровень усталости
группы повысится.

Возможное столкновение – при неблагоприятных условиях, плохих бросках, злобном ведущем и т.п. ситуациях, используйте
этот вариант. В принципе, он ничем не отличается от первоначального, кроме одного – вам предстоит встреча с кем-то
совершенно не в духе. При «путевой встрече» это могут быть нечистые на руку караванщики, которые, если группа искателей
приключений кажется им легкой добычей, нападут. При «привале» — герои встретятся с облюбовавшим это же место медведем
или патрулем зверолюдей.

Подсказка – вы получили относительно ценную информацию. Узнали о том, что поблизости чудовища, что рядом находится
деревня, что недавно здесь проходил путешественник и т.п.

Трата ресурсов – ох, в пути возникла ситуация, когда вам пришлось израсходовать часть ресурсов: запас дров,
дополнительные порции провианта, веревку и т.п.

Задержка в пути — что-то пошло не так и вы потеряли время, заблудились, вынуждены идти кружным путем, подвернули ногу и
т.п.

Дополнительные таблицы для столкновений
Неожиданность
Обе стороны делают бросок 1d6 и при выпадении значений 1-2, появление противника для них оказывается полной
неожиданностью, а сами они будут считаться застигнутыми врасплох.

Расстояние
Чтобы узнать расстояние на котором враги замечают друг друга, бросьте 1d6 (днем) и 1d4 (ночью), модифицировав этот
значение зоной видимости характерной для этого типа местности. Результаты:

Но с к носу (ближний бой возможен с ходу)
На расстоянии нескольких шагов (минимальный предел дистанционного боя без штрафов)
Среднее (1d6 х 30 футов, на дистанции прямого выстрела)
Дальнее (2d6+6 х 30 футов, вне прямой видимости)
Сверхдальнее (2d6+12 х 30 футов, вне прямой видимости)
На пределе видимости (10 минут бодрым шагом, вне прямой видимости)

Возможность бегства
Если вы не застигнуты врасплох, а расстояние до противника минимум среднее, у вас есть все шансы уклонится от боя, но
шанс успеха зависит как от размера вашей группы, так и от размера группы противников. Сделайте бросок 1d20 и
используйте проверочное число из таблицы ниже. В случае если результат броска выше или равен проверочному числу – вам
удалось избежать боя.

Размер группы	Проверочное число при броске 2d10
Одиночка	15
Маленькая (меньше 4)	17
Средняя (5-12)	19
Большая (13-24)	21
Огромная (25+)	23
Обратите внимание: если враг застигнут врасплох, а расстояние до противника минимум среднее – вы можете уклониться от
встречи автоматически.

Если преследующая группа больше вашей – проверочное число становится на 1 пункт меньше, если меньше – на 1 пункт
больше. Труднопроходимая местность также уменьшает шансы, пропорционально сложности преодоления преград. Лес, к
примеру, уменьшит проверку на 1, в то время как джунгли – сразу на 2.

Если вам не нравятся ваши шансы, можно разбить свою группу на более мелкие, чтобы повысить шансы к «пряткам». Конечно,
преследователи тоже могут провернуть этот трюк… но если они вас догонят, их, по крайней мере, будет меньше.

Дополнительные таблицы для возможных столкновений

Реакция противника
Когда вы сталкиваетесь с потенциально враждебными НИП или существами (см. Возможное столкновение), они не обязательно
будут сразу же вас атаковать. Все зависит от вашего поведения, места и времени. Если во время войны с соседним
королевством вы наткнетесь на  военный патруль, на их территории, вас не спасет никакая проверка реакции. В то же время
даже самые злобные «гвардейцы кардинала» из враждующей фракции не станут нападать на вас просто так, посреди городского
праздника.

Бросок 2d6	Реакция чудовища/НИП	Поведение
2	Враждебная / Атака	Ни на что не соглашается, атакует при малейшей угрозе (с его точки зрения).
3-5	Не дружественная / Готовность к атаке	Ни на что не соглашается, стоит на своем.
6-8	Нейтральная / Нельзя сказать точно	Сомневается. Можно попробовать ещё раз, с лучшим предложением
9-11	Безразличная / Вы не вызываете его интереса	Допускает возможность
12	Дружелюбная / Эй, давай дружить	Он согласен
"""
# from config.storm import CONFIG
from dice.dice import Dice
from .day import Day
from .event import DailyEvent, NightlyEvent


class EncountersManager:
    def __init__(self, **config):
        # next_roll = CONFIG.get('roll_on_double', False)
        self.roll_on_double = config.get('roll_on_double', True)

    @classmethod
    def __additional_events(cls, roll_on_double=False):
        dice1, dice2 = Dice(count=2).roll()

        if dice1 % 2:
            yield NightlyEvent()
        else:
            yield DailyEvent()

        if (dice1 == dice2) and roll_on_double:
            yield from cls.__additional_events(roll_on_double)

    @classmethod
    def events_for_day(cls, roll_on_double=False):
        yield DailyEvent()
        yield NightlyEvent()
        yield from cls.__additional_events(roll_on_double)

    def encounters(self, days_count=1, start_at_day=True, end_at_night=True):
        days = (Day(day_id, self.events_for_day(self.roll_on_double)) for day_id in range(days_count))
        for d in days:
            print('=' * 80)
            print('День {} из {}'.format(d.day_id + 1, days_count))
            print('-' * 80)
            d.show(
                show_daily=d.day_id > 0 or start_at_day,
                show_nightly=d.day_id < days_count - 1 or end_at_night,
            )
