items = [
    dict(
        roll=1,
        value="Щит Веры",
        description="Щит, на котором проявляется символ веры носящего. Бонусным действием носящий может назвать имя"
                    " божества и увеличить КД на 1 длительностью в 1 раунд.",
    ),
    dict(
        roll=2,
        value="Полевой Справочник Боевого Медика",
        description="Книга описывающая ранения и как их лечить на поле боя. При помощи нее можно проводить бросок"
                    " медицины с преимуществом если рядом опасность.",
    ),
    dict(
        roll=3,
        value="Болеутоляющий Бинт",
        description="Чистый белый бинт с рунами. Когда применяется, он лечит цель на 1d4+3 ХП, и поглощается.",
    ),
    dict(
        roll=4,
        value="Святой Ореол",
        description="Серебряный обруч, чтобы носить как корону. Он всегда источает свет, как если бы на него наложили"
                    " заклинание света. При помощи него так же можно раз в день наложить заклинание Благословения без"
                    " траты ячейки.",
    ),
    dict(
        roll=5,
        value="Свисток Помощи",
        description="Маленький хрустальный свисток с руной защиты на нем. Тот, кто дует в него накладывает заклинание"
                    " Духовного Стража 4 уровня. У него есть три заряда",
    ),
    dict(
        roll=6,
        value="Волшебный шар",
        description="Черный стеклянный шар, заполненный темной жидкостью. Им можно воспользоваться один раз как"
                     " заклинанием Общения. Ответ бога появится на стекле. После использования жидкость испаряется.",
    ),
    dict(
        roll=7,
        value="Награда Лекаря",
        description="Серебряная подвеска в форме сердца, укрытого крыльями. Когда носящий лечит существо на половину"
                    " здоровья и больше или стабилизирует умирающего - он восстанавливает ячейку заклинания 1 уровня.",
    ),
    dict(
        roll=8,
        value="Разитель",
        description="Булава из темной стали с белой рукоятью и религиозными символами. Когда носящий её использует"
                    " Божественный Канал, булава получает заряд. Следующее существо, по которому будет нанесен удар этой"
                    " булавой получит дополнительно 3d4 урона излучением.",
    ),
]
