encounters = [
    dict(roll=1, value="Партия светом потревожила рой летучих мышей. Они слетая с потолка и атакуют любого, кто несет"
                       " свет."),
    dict(roll=2, value="Из стен растут кристаллы кварца. Их можно отломать и взять как сувениры, но они недорогие."),
    dict(roll=3, value="На каменном полу странный участок с ярко-оранжевым мхом. Он покрывает любое живое существо,"
                       " которое будет находится на нем дольше 10 минут. Жертва получает урон 1d4+3 ядом каждые 10"
                       " минут, пока остается на нем."),
    dict(roll=4, value="Между сталагмитов спрятана сумка. Что обнаружить ее нужна пассивная внимательность 14 и выше. В"
                       " сумке 15 зм и 8 см."),
    dict(roll=5, value="По каменному полу бегают крысы. Похоже, что они нашли кости летучих мышей и грибы."),
    dict(roll=6, value="Довольно глубокий пруд. Когда кто-нибудь решает изучить этот пруд возникает чокер и пытается"
                       " утопить его"),
    dict(roll=7, value="Стены поросли светящимися грибами. Успешный бросок природы 15 и выше позволяет определить что"
                       " они не ядовитые и заставляют светиться рот съевшего их."),
    dict(roll=8, value="С потолка капает вода и формирует красивое каменное образование, напоминающее маяк."),
    dict(roll=9, value="С потолка на одежду одного из сопартийцев падает сороконожка. Она неприятна но безвредна."),
    dict(roll=10, value="Во тьме живет дуэргар. Он частично сошел с ума, говорит только на подземном и настороженно"
                        " относится к партии."),
]
